In [10]:
import pandas as pd

In [2]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [4]:
df=pd.read_excel("Book1.xlsx")

In [7]:
type(df)

pandas.core.frame.DataFrame

In [8]:
df.columns

Index(['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4'], dtype='object')

In [9]:
print(df)

   Unnamed: 0  Unnamed: 1  Unnamed: 2  Unnamed: 3 Unnamed: 4
0         NaN         NaN         NaN         NaN        NaN
1         NaN         NaN         NaN         NaN        NaN
2         NaN         NaN         NaN         NaN    Numbers
3         NaN         NaN         NaN         NaN          4
4         NaN         NaN         NaN         NaN          8
5         NaN         NaN         NaN         NaN         15
6         NaN         NaN         NaN         NaN         16
7         NaN         NaN         NaN         NaN         23
8         NaN         NaN         NaN         NaN         42

In [10]:
df['Unnamed: 4']

0        NaN
1        NaN
2    Numbers
3          4
4          8
5         15
6         16
7         23
8         42
Name: Unnamed: 4, dtype: object

In [11]:
type(df['Unnamed: 4'])

pandas.core.series.Series

In [1]:
l=[1,2,3,4,5,6,7,8,9,10]

In [4]:
pd.Series(l)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [8]:
df1=pd.read_excel("Book2.xlsx")

In [9]:
df1

   Unnamed: 0  Unnamed: 1  Unnamed: 2  Unnamed: 3    Name  Age  Gender
0         NaN         NaN         NaN         NaN   Alice   25  Female
1         NaN         NaN         NaN         NaN     Bob   30    Male
2         NaN         NaN         NaN         NaN  Claire   27  Female

In [1]:
# 4 Ans A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

# In summary, a DataFrame is a 2-dimensional data structure designed for handling tabular data with multiple columns, 
# while a Series is a 1-dimensional data structure used to represent
# a single column or row of data within a DataFrame or as a standalone data structure

# Data frame has mulitplr columns while pandas series has only one columns

In [3]:
# 5 Ans 

# read_csv() This is one of the most crucial pandas methods in Python. ...
# head() head(n) is used to return the first n rows of a dataset. ...
# describe() ...
# memory_usage() ...
# astype() ...
# loc[:] ...
# to_datetime() ...
# value_counts()

In [4]:
# 6 Ans All Pandas data structures are value mutable (can be changed) and except Series all are size mutable

In [11]:
# 7 Ans

df3=pd.read_csv("data.csv")

In [12]:
df3.columns

Index(['Rk', 'Player', 'Pos', 'Age', 'Tm', 'G', 'GS', 'MP', 'FG', 'FGA', 'FG%',
       '3P', '3PA', '3P%', '2P', '2PA', '2P%', 'eFG%', 'FT', 'FTA', 'FT%',
       'ORB', 'DRB', 'TRB', 'AST', 'STL', 'BLK', 'TOV', 'PF', 'PTS'],
      dtype='object')

In [13]:
df3[['STL','TOV']]

     STL  TOV
0     27   60
1     16   14
2     38   99
3      4    9
4     41  116
..   ...  ...
670  124  117
671   86   75
672   38   42
673   34   62
674   18   76

[675 rows x 2 columns]